In [2]:
import pandas as pd

In [6]:
data={'NAME':['jay','prince','nisha','neha','raj','riya'],
      'Age':[17,20,21,18,19,25],
      'Gender':['M','M','F','F','M','M'],
      'Marks':[90,75,80,84,71,86]
}

In [7]:
print(data)

{'NAME': ['jay', 'prince', 'nisha', 'neha', 'raj', 'riya'], 'Age': [17, 20, 21, 18, 19, 25], 'Gender': ['M', 'M', 'F', 'F', 'M', 'M'], 'Marks': [90, 75, 80, 84, 71, 86]}

In [10]:
print(pd.DataFrame(data))

     NAME  Age Gender  Marks
0     jay   17      M     90
1  prince   20      M     75
2   nisha   21      F     80
3    neha   18      F     84
4     raj   19      M     71
5    riya   25      M     86

In [11]:
data1={'NAME':['jay','prince','nisha','neha','raj','riya'],
      'Age':[17,20,21,18,19,25],
      'Gender':['M','M','F','F','M','M'],
      'Marks':[90,75,'nan',84,'nan',86]
}

In [12]:
print(pd.DataFrame(data1))

     NAME  Age Gender Marks
0     jay   17      M    90
1  prince   20      M    75
2   nisha   21      F   nan
3    neha   18      F    84
4     raj   19      M   nan
5    riya   25      M    86

In [13]:
dp=pd.DataFrame(data)

In [14]:
dp

     NAME  Age Gender  Marks
0     jay   17      M     90
1  prince   20      M     75
2   nisha   21      F     80
3    neha   18      F     84
4     raj   19      M     71
5    riya   25      M     86

In [15]:
dp['Gender']=dp['Gender'].map({'M':0,'F':1}).astype(float)

In [16]:
dp

     NAME  Age  Gender  Marks
0     jay   17     0.0     90
1  prince   20     0.0     75
2   nisha   21     1.0     80
3    neha   18     1.0     84
4     raj   19     0.0     71
5    riya   25     0.0     86

In [17]:
dp=df[df['Marks']>-75]

In [18]:
df

     NAME  Age Gender  Marks
0     jay   17      M     90
1  prince   20      M     75
2   nisha   21      F     80
3    neha   18      F     84
4     raj   19      M     71
5    riya   25      M     86

In [19]:
dp=df[df['Marks']>75]

In [20]:
dp

    NAME  Age Gender  Marks
0    jay   17      M     90
2  nisha   21      F     80
3   neha   18      F     84
5   riya   25      M     86

In [21]:
df=df.drop(['Age'],axis=1)

In [22]:
df

     NAME Gender  Marks
0     jay      M     90
1  prince      M     75
2   nisha      F     80
3    neha      F     84
4     raj      M     71
5    riya      M     86

In [ ]:
details=pd.DataFrame